Art Share API/app/controllers/artworks_controller.rb

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Last Supper"], ["image_url", "google.com/thelastsupper"], ["artist_id", 6], ["created_at", "2023-02-07 20:58:28.135153"], ["updated_at", "2023-02-07 20:58:28.135153"]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 7], ["updated_at", "2023-02-07 21:05:44.166524"], ["id", 4]]

    def destroy
        artwork = Artwork.find(params[:id])
        if artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]