Art Share API/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "toemilyy@yahoo.com"], ["updated_at", "2023-02-05 20:48:23.085891"], ["id", 5]]